Repository: alienator88/Pearcleaner
Catalog: Pearcleaner/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, id, it, ja, ko, pl, pt_br, ru, sk, sl, tr, uk, vi, zh_hans, zh_hant, zh_hk

source: Web app
de: Webanwendung
es: Aplicación web
fr: Application Web
id: Aplikasi web
it: App web
ja: ウェブアプリ
ko: 웹 앱
pl: Aplikacja internetowa
pt_br: Aplicativo web
ru: Веб-приложение
sk: Webová aplikácia
sl: Spletna aplikacija
tr: Web uygulaması
uk: Веб програма
vi: Ứng dụng web
zh_hans: 网页应用
zh_hant: 網頁 App
zh_hk: 網頁 App

source: Weekly
de: Wöchentlich
es: Semanal
fr: Hebdomadaire
id: Mingguan
it: Settimanale
ja: 毎週
ko: 주간
pl: Tygodniowo
pt_br: Semanal
ru: Еженедельно
sk: Týždenne
sl: Tedensko
tr: Haftalık
uk: Щотижня
vi: Hàng tuần
zh_hans: 每周
zh_hant: 每星期
zh_hk: 每星期

source: When applications are moved to Trash, Pearcleaner will launch and find related files and folders for deletion.
de: Wenn Programme in den Papierkorb verschoben werden, startet Pearcleaner und sucht nach zugehörigen Dateien und Ordnern, um diese zu löschen.
es: Cuando las aplicaciones se mueven a la Papelera, Pearcleaner se iniciará y encontrará archivos y carpetas relacionados para su eliminación.
fr: Lorsque des applications sont déplacées dans la Corbeille, Pearcleaner se lance et trouve les fichiers et dossiers associés pour les supprimer.
id: Ketika aplikasi dipindahkan ke Sampah, Pearcleaner akan diluncurkan dan menemukan file serta folder terkait untuk dihapus.
it: Quando le applicazioni vengono spostate nel Cestino, Pearcleaner si avvierà e troverà i file e le cartelle correlate per l'eliminazione.
ja: アプリケーションがゴミ箱に移動されると、Pearcleanerが起動し、関連するファイルとフォルダーを検索して削除します。
ko: 애플리케이션이 휴지통으로 이동되면 Pearcleaner가 실행되어 삭제할 관련 파일 및 폴더를 찾습니다.
pl: Gdy aplikacje zostaną przeniesione do Kosza, Pearcleaner uruchomi się i wyszuka powiązane pliki i foldery do usunięcia.
pt_br: Quando os aplicativos são movidos para o Lixo, o Pearcleaner será iniciado e encontrará arquivos e pastas relacionados para exclusão
ru: Когда приложения будут перемещены в корзину, запустится программа Pearcleaner и найдет соответствующие файлы и папки для удаления.
sk: Keď sa aplikácie presunú do koša, spustí sa Pearcleaner a nájde súvisiace súbory a priečinky na odstránenie.
sl: Ko so aplikacije premaknjene v koš, se bo Pearcleaner zagnal in poiskal povezane datoteke in mape za brisanje.
tr: Uygulamalar Çöp Sepeti’ne taşınınca Pearcleaner çalışacak ve silmek için ilgili dosya ve klasörleri bulacaktır.
uk: Коли програми буде переміщено до Смітника, Pearcleaner запуститься і знайде відповідні файли та папки для видалення.
vi: Khi ứng dụng được đưa vào Thùng rác, Pearcleaner sẽ tự động khởi động và dò tìm các tệp, thư mục liên quan để xóa bỏ
zh_hans: 当应用程序被移动到废纸篓时，Pearcleaner 将启动并查找相关的文件和文件夹以进行删除。
zh_hant: 當應用程式丟到垃圾桶時，Pearcleaner 會啟動並尋找要刪除的相關檔案和資料夾。
zh_hk: 當應用程式丟到垃圾桶時，Pearcleaner 會啟動並尋找要刪除的相關檔案和資料夾。

source: When deleting files using the Trash button, you can prevent accidental deletions by showing an alert before proceeding with the action.
de: Zeige eine Warnung, damit vor dem versehentlich Löschen von Dateien im Papierkorb gewartet wird.
es: Al eliminar archivos con el botón de Papelera, puede evitar eliminaciones accidentales mostrando una alerta antes de continuar con la acción.
fr: Lorsque vous supprimez des fichiers en utilisant le bouton Corbeille, vous pouvez éviter les suppressions accidentelles de fichiers/dossiers en affichant une alerte avant de procéder à l'action.
id: Saat menghapus file menggunakan tombol Sampah, Anda dapat mencegah penghapusan yang tidak disengaja dengan menampilkan peringatan sebelum melanjutkan tindakan tersebut.
it: Quando elimini file utilizzando il pulsante Cestino, puoi prevenire eliminazioni accidentali mostrando un avviso prima di procedere con l'azione.
ja: ゴミ箱ボタンを使用してファイルを削除する場合、アラートを表示してからアクションを実行することで、誤った削除を防ぐことができます。
ko: 휴지통 버튼을 사용하여 파일을 삭제할 때, 작업을 진행하기 전에 경고를 표시하여 실수로 삭제하는 것을 방지할 수 있습니다.
pl: Podczas usuwania plików za pomocą przycisku Kosz można zapobiec przypadkowemu usunięciu, wyświetlając ostrzeżenie przed wykonaniem tej czynności.
pt_br: Ao excluir arquivos usando o botão Lixeira, você pode evitar exclusões acidentais exibindo um alerta antes de prosseguir com a ação.
ru: При удалении файлов с помощью кнопки "Удалить" вы можете предотвратить случайное удаление, показав предупреждение перед выполнением действия.
sk: Pri odstraňovaní súborov pomocou tlačidla Koš môžeš zabrániť nechcenému odstráneni tým, že sa zobrazí upozornenie pred pokračovaním v akcii.
sl: Ko brišete datoteke z gumbom za smeti, lahko preprečite nenamerno brisanje tako, da pred nadaljevanjem prikažete opozorilo.
tr: Çöp Sepeti butonunu kullanarak dosyalar silinirken, işleme devam etmeden önce ek bir uyarı göstererek kazara silmelerin önüne geçebilirsiniz.
uk: Видаляючи файли за допомогою кнопки Смітник, ви можете запобігти випадковому видаленню, показавши попередження перед тим, як продовжити дію.
vi: Khi xóa tệp bằng nút có biểu tượng Thùng rác, bạn có thể tránh xóa nhầm bằng cách hiển thị một thông báo xác nhận trước khi thực hiện hành động đó.
zh_hans: 使用废纸篓按钮删除文件时，可以通过在执行操作之前显示警报来防止意外删除。
zh_hant: 使用「垃圾桶」按鈕刪除檔案時，你可以在繼續此動作前顯示警告以避免意外刪除。
zh_hk: 使用「垃圾桶」按鈕刪除檔案時，你可以在繼續此動作前顯示警告以避免意外刪除。

source: When Homebrew cleanup is enabled, Pearcleaner will check if the app you are removing was installed via Homebrew and launch Terminal.app to execute a brew uninstall and cleanup command to let Homebrew know that the app is removed. This way your Homebrew list will be synced up correctly and caching will be removed. Terminal.app is required since some apps need sudo permissions to remove services and files placed in system folders. Since other terminal apps don't support AppleScript and/or the 'do script' command, I opted to use the default macOS Terminal app for this. NOTE: If you undo the file delete with CMD+Z, the files will be put back but Homebrew will not be aware of it. To get the Homebrew list back in sync you'd need to run: > brew install APPNAME --force
de: Wenn die Homebrew-Bereinigung aktiviert ist, prüft Pearcleaner, ob die zu entfernende Anwendung über Homebrew installiert wurde und startet Terminal.app, um einen Befehl zum Deinstallieren und Bereinigen von Homebrew auszuführen, damit Homebrew weiss, dass die Anwendung entfernt wurde. Auf diese Weise wird Ihre Homebrew-Liste korrekt synchronisiert und die Zwischenspeicherung wird entfernt. Terminal.app ist erforderlich, da einige Anwendungen sudo-Berechtigungen benötigen, um Dienste und Dateien in Systemordnern zu entfernen. Da andere Terminal-Apps AppleScript und/oder den Befehl "do script" nicht unterstützen, habe ich mich dafür entschieden, die Standard macOS Terminal-App zu verwenden. HINWEIS: Wenn Sie das Löschen von Dateien mit CMD+Z rückgängig machen, werden die Dateien wiederhergestellt, aber Homebrew wird davon nichts mitbekommen. Um die Homebrew-Liste wieder zu synchronisieren, müssen Sie den Befehl ausführen: > brew install APPNAME --force
es: Cuando la limpieza de Homebrew está habilitada, Pearcleaner verificará si la aplicación que estás eliminando se instaló a través de Homebrew y abrirá Terminal.app para ejecutar un comando de desinstalación y limpieza de brew para informar a Homebrew que la aplicación ha sido eliminada. De esta forma, tu lista de Homebrew se sincronizará correctamente y se eliminará el almacenamiento en caché. Se requiere Terminal.app ya que algunas aplicaciones necesitan permisos de sudo para eliminar servicios y archivos ubicados en carpetas del sistema. Dado que otras aplicaciones de terminal no soportan AppleScript y/o el comando 'do script', opté por usar la aplicación Terminal predeterminada de macOS para esto NOTA: Si deshaces la eliminación del archivo con CMD+Z, los archivos se restaurarán pero Homebrew no estará al tanto de ello. Para volver a sincronizar la lista de Homebrew, necesitarías ejecutar: > brew install APPNAME --force
fr: Lorsque le nettoyage Homebrew est activé, Pearcleaner vérifiera si l'application que vous supprimez a été installée via Homebrew et lancera Terminal.app pour exécuter une commande de désinstallation et de nettoyage brew afin de signaler à Homebrew que l'application a été supprimée. De cette façon, votre liste Homebrew sera correctement synchronisée et le cache sera supprimé. Terminal.app est requis car certaines applications nécessitent des autorisations sudo pour supprimer des services et des fichiers placés dans des dossiers système. Étant donné que d'autres applications de terminal ne prennent pas en charge AppleScript et/ou la commande 'do script', Pearcleaner a choisi d'utiliser l'application Terminal par défaut de macOS pour cela. NOTE : Si vous annulez la suppression du fichier avec ⌘+Z, les fichiers seront remis en place mais Homebrew ne sera pas au courant. Pour resynchroniser la liste Homebrew, vous devrez exécuter : > brew install APPNAME --force
id: Saat Homebrew cleanup diaktifkan, Pearcleaner akan memeriksa apakah aplikasi yang Anda hapus diinstal melalui Homebrew dan meluncurkan Terminal.app untuk menjalankan perintah brew uninstall dan cleanup agar Homebrew tahu bahwa aplikasi tersebut telah dihapus. Dengan cara ini, daftar Homebrew Anda akan disinkronkan dengan benar dan caching akan dihapus. Terminal.app diperlukan karena beberapa aplikasi memerlukan izin sudo untuk menghapus layanan dan file yang ditempatkan di folder sistem. Karena aplikasi terminal lain tidak mendukung AppleScript dan/atau perintah 'do script', saya memilih untuk menggunakan aplikasi Terminal bawaan macOS untuk ini. CATATAN: Jika Anda membatalkan penghapusan file dengan CMD+Z, file akan dikembalikan tetapi Homebrew tidak akan menyadarinya. Untuk menyinkronkan kembali daftar Homebrew, Anda perlu menjalankan: > brew install APPNAME --force
it: Quando la pulizia di Homebrew è abilitata, Pearcleaner controllerà se l'app che stai rimuovendo è stata installata tramite Homebrew e avvierà Terminal.app per eseguire un comando di disinstallazione e pulizia di brew per informare Homebrew che l'app è stata rimossa. In questo modo, la tua lista di Homebrew sarà sincronizzata correttamente e la cache verrà rimossa. Terminal.app è necessario poiché alcune app richiedono permessi sudo per rimuovere servizi e file posizionati nelle cartelle di sistema. Poiché altre app terminali non supportano AppleScript e/o il comando 'do script', ho optato per utilizzare l'app Terminal predefinita di macOS per questo. NOTA: Se annulli l'eliminazione del file con CMD+Z, i file verranno ripristinati ma Homebrew non ne sarà a conoscenza. Per riportare la lista di Homebrew in sincronia, dovresti eseguire: > brew install APPNAME --force
ja: Homebrewのクリーンアップが有効になっている場合、Pearcleanerはアプリを削除する際にHomebrewを介してインストールされたかどうかを確認し、Terminal.appを起動してbrew uninstallとクリーンアップコマンドを実行して、Homebrewにアプリが削除されたことを通知します。この方法でHomebrewのリストが正しく同期され、キャッシュが削除されます。システムフォルダーに配置されたサービスやファイルを削除するには、一部のアプリにsudo権限が必要なため、Terminal.appが必要です。他のターミナルアプリはAppleScriptや'do script'コマンドをサポートしていないため、デフォルトのmacOS Terminalアプリを使用することにしました。 注意: CMD+Zでファイル削除を元に戻すと、ファイルは元に戻りますが、Homebrewはそれを認識しません。Homebrewのリストを再度同期させるには、次のコマンドを実行する必要があります: > brew install APPNAME --force
ko: Homebrew 정리가 활성화되면 Pearcleaner는 제거하려는 앱이 Homebrew를 통해 설치되었는지 확인하고 Terminal.app을 실행하여 brew uninstall 및 cleanup 명령을 실행하여 Homebrew에 앱이 제거되었음을 알립니다. 이렇게 하면 Homebrew 목록이 올바르게 동기화되고 캐싱이 제거됩니다. 일부 앱은 시스템 폴더에 배치된 서비스 및 파일을 제거하기 위해 sudo 권한이 필요하므로 Terminal.app이 필요합니다. 다른 터미널 앱은 AppleScript 및/또는 'do script' 명령을 지원하지 않으므로 기본 macOS Terminal 앱을 사용하기로 했습니다. 참고: CMD+Z로 파일 삭제를 실행 취소하면 파일이 복원되지만 Homebrew는 이를 인식하지 못합니다. Homebrew 목록을 다시 동기화하려면 다음을 실행해야 합니다: > brew install APPNAME --force
pl: Gdy włączona jest funkcja czyszczenia Homebrew, Pearcleaner sprawdzi, czy usuwana aplikacja została zainstalowana za pomocą Homebrew, i uruchomi aplikację Terminal.app, aby wykonać polecenie brew uninstall i cleanup, informujące Homebrew o usunięciu aplikacji. W ten sposób lista Homebrew zostanie poprawnie zsynchronizowana, a pamięć podręczna zostanie usunięta. Aplikacja Terminal.app jest wymagana, ponieważ niektóre aplikacje potrzebują uprawnień sudo do usuwania usług i plików umieszczonych w folderach systemowych. Ponieważ inne aplikacje terminalowe nie obsługują AppleScript i/lub polecenia ‘do script’, zdecydowałem się użyć do tego domyślnej aplikacji Terminal w systemie macOS. UWAGA: Jeśli cofniesz usunięcie plików za pomocą CMD+Z, pliki zostaną przywrócone, ale Homebrew nie będzie o tym wiedzieć. Aby ponownie zsynchronizować listę Homebrew, należy uruchomić: > brew install NAZWA-APLIKACJI --force
pt_br: Quando a limpeza do Homebrew está ativada, o Pearcleaner verificará se o aplicativo que você está removendo foi instalado via Homebrew e lançará o Terminal.app para executar um comando de desinstalação e limpeza do brew para informar ao Homebrew que o aplicativo foi removido. Dessa forma, sua lista do Homebrew será sincronizada corretamente e o cache será removido. O Terminal.app é necessário, pois alguns aplicativos precisam de permissões sudo para remover serviços e arquivos colocados em pastas do sistema. Como outros aplicativos de terminal não suportam AppleScript e/ou o comando 'do script', optei por usar o aplicativo padrão Terminal do macOS para isso. NOTA: Se você desfizer a exclusão de arquivos com CMD+Z, os arquivos serão reinstaurados, mas o Homebrew não ficará ciente disso. Para colocar a lista do Homebrew em sincronia novamente, você precisaria executar: > brew install APPNAME --force
ru: Когда включена очистка Homebrew, Pearcleaner проверит, был ли удаляемый вами приложение установлено через Homebrew, и запустит Terminal.app для выполнения команды brew uninstall и последующей очистки — чтобы Homebrew узнал, что приложение удалено. Благодаря этому список Homebrew останется корректным, а кэш будет очищен. Для этой операции требуется Terminal.app, поскольку некоторые приложения требуют прав sudo для удаления служб и файлов, размещённых в системных папках. Другие терминальные приложения не поддерживают AppleScript и/или команду do script, поэтому я выбрал стандартный терминал macOS. ПРИМЕЧАНИЕ: Если вы отмените удаление файлов с помощью Cmd+Z, файлы вернутся, но Homebrew об этом не узнает. Чтобы синхронизировать список Homebrew заново, выполните: > brew install APPNAME --force
sk: Po zapnutí vyčistenia Homebrew, Pearcleaner skontroluje, či bola aplikácia, ktorú odstraňuješ nainštalovaná pomocou Homebrew. Následne spustí Terminal.app a vykoná príkaz brew uninstall a brew cleanup a informuje Homebrew o odstránení aplikácie. Takto sa Homebrew zoznam správne synchronizuje a vyrovnácia pamäť vyčistí. Terminal.app je potrebná, pretože niektoré aplikácie vyžadujú sudo oprávnenia na odstránenie služieb a súborov umiestnených v systémových priečinkoch. Keďže iné terminálové aplikácie nepodporujú AppleScript a/alebo do script príkaz, rozhodol som sa použiť predvolenú aplikáciu Terminal. UPOZORNENIE: Ak vrátiš späť odstránenie súborov pomocou CMD+Z, súbory sa obnovia, ale Homebrew o tom nebude vedieť. Na opätovné zosynchronizovanie zoznamu Homebrew budeš musieť spustiť príkaz: > brew install NAZOVAPLIKACIE --force
sl: Ko je omogočeno čiščenje Homebrew, bo Pearcleaner preveril, ali je bila aplikacija, ki jo odstranjujete, nameščena prek Homebrew, in zagnal Terminal.app za izvedbo ukaza za odstranitev in čiščenje, da Homebrew obvesti, da je aplikacija odstranjena. Tako bo vaš seznam Homebrew pravilno sinhroniziran in predpomnjenje bo odstranjeno. Terminal.app je potreben, ker nekatere aplikacije potrebujejo sudo dovoljenja za odstranitev storitev in datotek, nameščenih v sistemske mape. Ker druge terminalske aplikacije ne podpirajo AppleScript in/ali ukaza 'do script', sem se odločil uporabiti privzeto aplikacijo Terminal macOS za to. OPOMBA: Če razveljavite brisanje datoteke s CMD+Z, bodo datoteke vrnjene, vendar Homebrew tega ne bo vedel. Da bi seznam Homebrew ponovno sinhronizirali, bi morali zagnati: > brew install APPNAME --force
tr: Homebrew temizliği etkinken, Pearcleaner kaldırdığınız uygulamanın Homebrew aracılığı ile yüklenip yüklenmediğini kontrol edecek ve Homebrew’e uygulamanın kaldırıldığını bildirmek amacıyla brew uninstall ve cleanup komutlarını çalıştırmak için Terminal.app’i açacaktır. Böylece Homebrew listeniz düzgünce senkronize olacak ve önbellekleme kaldırılacaktır. Terminal.app, bazı uygulamalar sistem klasörlerindeki dosyalar ve servisleri kaldırmak için sudo izinlerine ihtiyaç duyduğu için gereklidir. Diğer terminal uygulamaları AppleScript ve/veya ‘do script’ komutunu desteklemediğinden bunun için varsayılan macOS Terminal uygulamasını kullanmayı seçtim. NOT: CMD+Z ile dosya silme işlemini geri alırsanız, dosyalar geri konacaktır ancak Homebrew bunun farkında olmayacaktır. Homebrew listesini tekrar senkronize etmek için şu komutu çalıştırmanız gerekir: > brew install UYGULAMAADI --force
uk: Якщо очищення Homebrew увімкнено, Pearcleaner перевірить, чи програму, яку ви видаляєте, було встановлено через Homebrew, і запустить програму Terminal.app для виконання команди видалення і очищення, щоб повідомити Homebrew, що програму видалено. Таким чином ваш список Homebrew буде правильно синхронізовано, а кешування буде видалено. Terminal.app є необхідним, оскільки деякі програми потребують дозволів sudo для видалення служб і файлів, розміщених у системних теках. Оскільки інші термінальні програми не підтримують AppleScript та/або команду «do script», я вирішив використати для цього стандартну програму macOS Terminal. ПРИМІТКА: Якщо ви скасуєте видалення файлів за допомогою CMD+Z, файли буде відновлено, але Homebrew не знатиме про це. Щоб відновити синхронізацію списку Homebrew, вам потрібно виконати > brew install APPNAME --force
vi: Khi bật tính năng dọn "Homebrew cleanup", Pearcleaner sẽ kiểm tra xem ứng dụng đang gỡ có được cài đặt thông qua Homebrew hay không và sẽ mở ứng dụng Terminal.app để chạy lệnh brew uninstall và cleanup, nhằm thông báo cho Homebrew biết rằng ứng dụng đã bị gỡ. Cách này giúp danh sách ứng dụng trong Homebrew được đồng bộ chính xác và loại bỏ các tệp bộ nhớ đệm. Ứng dụng Terminal.app mặc định của macOS là bắt buộc vì một số ứng dụng cần quyền sudo để gỡ bỏ dịch vụ và các tệp nằm trong thư mục hệ thống. Do các ứng dụng terminal khác không hỗ trợ AppleScript và/hoặc lệnh 'do script', do đó Pearcleaner đã chọn sử dụng ứng dụng Terminal.app mặc định của macOS cho thao tác này. Lưu ý: Nếu bạn hoàn tác việc xóa tệp bằng phím tắt CMD+Z, các tệp sẽ được khôi phục, nhưng Homebrew sẽ không biết điều đó. Để đồng bộ lại danh sách Homebrew, bạn cần chạy lệnh: > brew install APPNAME --force
zh_hans: 当启用 Homebrew 清理时，Pearcleaner 将检查您要删除的应用程序是否通过 Homebrew 安装，并启动 终端.app 来执行brew uninstall和cleanup命令，以便让Homebrew知道该应用已被删除。这样，您的Homebrew列表将正确同步，缓存将被移除。需要 终端.app，因为某些应用程序需要 sudo 权限才能删除服务和放置在系统文件夹中的文件。由于其他终端应用程序不支持 AppleScript 和/或 'do script' 命令，因此我选择使用默认的 macOS 终端 应用程序。 注意：如果您使用CMD+Z撤销文件删除，文件将被恢复，但Homebrew将不会意识到这一点。要使Homebrew列表重新同步，您需要运行： > brew install APPNAME --force
zh_hant: 啟用「Homebrew 清理」時，Pearcleaner 會檢查你要移除的應用程式是否透過 Homebrew 安裝，並啟動「終端機.app」以執行 brew 解除安裝和清理命令，讓 Homebrew 知道此應用程式已移除。這樣你的 Homebrew 列表會正確同步，快取檔案亦會被移除。這需要「終端機.app」，因為一些應用程式需要 sudo 權限才能移除系統資料夾中的服務和檔案。由於其他終端機應用程式不支援 AppleScript 和/或「do script」命令，因此這裡使用預設的 macOS 終端機應用程式。 注意：如你使用 ⌘Z 還原刪除檔案，檔案將會放回，但 Homebrew 並不會注意到這一點。如要重新同步 Homebrew 列表，你需要執行： > brew install APPNAME --force
zh_hk: 啟用「Homebrew 清理」時，Pearcleaner 會檢查你要移除的應用程式是否透過 Homebrew 安裝，並啟動「終端機.app」以執行 brew 解除安裝和清理命令，讓 Homebrew 知道此應用程式已移除。這樣你的 Homebrew 列表會正確同步，快取檔案亦會被移除。這需要「終端機.app」，因為一些應用程式需要 sudo 權限才能移除系統資料夾中的服務和檔案。由於其他終端機應用程式不支援 AppleScript 和/或「do script」命令，因此這裡使用預設的 macOS 終端機應用程式。 注意：如你使用 ⌘Z 還原刪除檔案，檔案將會放回，但 Homebrew 並不會注意到這一點。如要重新同步 Homebrew 列表，你需要執行： > brew install APPNAME --force

source: When Homebrew cleanup is enabled, Pearcleaner will check if the app you are removing was installed via Homebrew and remove the cache to keep everything synced up.
de: Wenn die Homebrew-Bereinigung aktiviert ist, überprüft Pearcleaner, ob die App, die Sie entfernen, über Homebrew installiert wurde, und entfernt den Cache, um alles synchron zu halten.
es: Cuando la limpieza de Homebrew está habilitada, Pearcleaner verificará si la aplicación que está eliminando fue instalada a través de Homebrew y eliminará el caché para mantener todo sincronizado.
fr: Lorsque le nettoyage Homebrew est activé, Pearcleaner vérifiera si l'application que vous supprimez a été installée via Homebrew et supprimera le cache pour tout synchroniser.
id: Ketika pembersihan Homebrew diaktifkan, Pearcleaner akan memeriksa apakah aplikasi yang Anda hapus diinstal melalui Homebrew dan menghapus cache untuk menjaga semuanya tetap sinkron.
it: Quando la pulizia di Homebrew è abilitata, Pearcleaner verificherà se l'app che stai rimuovendo è stata installata tramite Homebrew e rimuoverà la cache per mantenere tutto sincronizzato.
ja: Homebrew のクリーンアップが有効になっている場合、Pearcleaner は削除しているアプリが Homebrew 経由でインストールされたかどうかを確認し、すべてを同期させるためにキャッシュを削除します。
ko: Homebrew 정리가 활성화되면 Pearcleaner는 제거 중인 앱이 Homebrew를 통해 설치되었는지 확인하고 캐시를 제거하여 모든 것을 동기화 상태로 유지합니다.
pl: Gdy czyszczenie Homebrew jest włączone, Pearcleaner sprawdzi, czy aplikacja, którą usuwasz, została zainstalowana za pomocą Homebrew i usunie pamięć podręczną, aby wszystko było zsynchronizowane.
pt_br: Quando a limpeza do Homebrew está ativada, o Pearcleaner verificará se o aplicativo que você está removendo foi instalado via Homebrew e removerá o cache para manter tudo sincronizado.
ru: Когда очистка Homebrew включена, Pearcleaner проверит, была ли удаляемая вами программа установлена через Homebrew, и удалит кэш, чтобы все оставалось синхронизированным.
sk: Keď je povolené čistenie Homebrew, Pearcleaner skontroluje, či aplikácia, ktorú odstraňujete, bola nainštalovaná cez Homebrew, a odstráni vyrovnávaciu pamäť, aby všetko zostalo synchronizované.
sl: Ko je omogočeno čiščenje Homebrew, bo Pearcleaner preveril, ali je aplikacija, ki jo odstranjujete, nameščena prek Homebrew, in odstranil predpomnilnik, da bo vse sinhronizirano.
tr: Homebrew temizliği etkinleştirildiğinde, Pearcleaner kaldırmakta olduğunuz uygulamanın Homebrew üzerinden yüklenip yüklenmediğini kontrol edecek ve her şeyin senkronize kalması için önbelleği kaldıracaktır.
uk: Коли увімкнено очищення Homebrew, Pearcleaner перевірить, чи була програма, яку ви видаляєте, встановлена через Homebrew, і видалить кеш, щоб усе залишалося синхронізованим.
vi: Khi dọn dẹp Homebrew được bật, Pearcleaner sẽ kiểm tra xem ứng dụng bạn đang gỡ bỏ có được cài đặt qua Homebrew hay không và xóa bộ nhớ đệm để giữ mọi thứ đồng bộ.
zh_hans: 当启用 Homebrew 清理时，Pearcleaner 会检查您正在移除的应用程序是否通过 Homebrew 安装，并移除缓存以保持所有内容同步。
zh_hant: 當啟用 Homebrew 清理時，Pearcleaner 會檢查您正在移除的應用程式是否通過 Homebrew 安裝，並移除緩存以保持所有內容同步。
zh_hk: 當啟用 Homebrew 清理時，Pearcleaner 會檢查您正在移除的應用程式是否通過 Homebrew 安裝，並移除緩存以保持所有內容同步。
